app/views/books/_index.html.erb

SELECT "books".* FROM "books" ORDER BY favorite
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
        <td class="favorite-btn"><%= render 'favorites/favorite-btn', book: book %></td>
        <td class="comments-count">コメント数:<%= book.book_comments.count %></td>